cases/Ypipe-s4/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-.2 -2.1 -0.3)
    (2.7 -2.1 -0.3)
    (2.7  2.6 -0.3)
    (-.2  2.6 -0.3)
    (-.2 -2.1 0.3)
    (2.7 -2.1 0.3)
    (2.7  2.6 0.3)
    (-.2  2.6 0.3)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (27 39 6) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    frontAndBack
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
            (0 4 7 3)
            (2 6 5 1)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
